Object.defineProperty(exports, "__esModule", { value: true });
const { zokou } = require("../framework/zokou");

zokou({ nomCom: "repo", catégorie:"Général", reaction: "💥", nomFichier: __filename }, async (dest, zk, commandeOptions) => {
  const githubRepo = ' https://github.com/mrblackkillersy-cmd/---';
  const img = 'https://files.catbox.moe/rqlfwv.jpg';

  try {
    const response = await fetch(githubRepo);
    const data = await response.json();

    if (data) {
      const repoInfo = {
        stars: data.stargazers_count,
        forks: data.forks_count,
        lastUpdate: data.updated_at,
        owner: data.owner.login,
      };

      const releaseDate = new Date(data.created_at).toLocaleDateString('en-GB');
      const lastUpdateDate = new Date(data.updated_at).toLocaleDateString('en-GB');

      const gitdata = `*hellow whatsaap user
this is* *𝔹𝕃𝔸ℂ𝕂 𝕂𝕀𝕃𝕃𝔼ℝ-𝕏𝕄𝔻.*\n
⫷⫷⫷⫷⫷⫷⫷⫷⫷⫷⫷⫷⫷⫷⫷
      💀 𝔹𝕃𝔸ℂ𝕂 𝕂𝕀𝕃𝕃𝔼ℝ-𝕏𝕄𝔻 💀
⫸⫸⫸⫸⫸⫸⫸⫸⫸⫸⫸⫸⫸⫸⫸

╔═════════════════════╗
║ 🔗 𝗥𝗘𝗣𝗢𝗦𝗜𝗧𝗢𝗥𝗬
╠═════════════════════╣
║ 👉 ${data.html_url}
╚═════════════════════╝
╔═════════════════════╗
║ 🌟 𝗦𝗧𝗔𝗥𝗦
╠═════════════════════╣
║ 👉 ${repoInfo.stars}
╚═════════════════════╝
╔═════════════════════╗
║ 🍴 𝗙𝗢𝗥𝗞𝗦
╠═════════════════════╣
║ 👉 ${repoInfo.forks}
╚═════════════════════╝
╔═════════════════════╗
║ ⌛ 𝗥𝗘𝗟𝗘𝗔𝗦𝗘 𝗗𝗔𝗧𝗘
╠═════════════════════╣
║ 👉 ${releaseDate}
╚═════════════════════╝
╔═════════════════════╗
║ 🕐 𝗟𝗔𝗦𝗧 𝗨𝗣𝗗𝗔𝗧𝗘
╠═════════════════════╣
║ 👉 ${repoInfo.lastUpdate}
╚═════════════════════╝
╔═════════════════════╗
║ 👨‍💻 𝗢𝗪𝗡𝗘𝗥
╠═════════════════════╣
║ 👉 𝔹𝕃𝔸ℂ𝕂 𝕂𝕀𝕃𝕃𝔼ℝ-𝕏𝕄𝔻
╚═════════════════════╝
╔═════════════════════╗
║ 🎭 𝗧𝗛𝗘𝗠𝗘
╠═════════════════════╣
║ 👉 𝔹𝕃𝔸ℂ𝕂 𝕂𝕀𝕃𝕃𝔼ℝ-𝕏𝕄𝔻
╚═════════════════════╝
━━━━━━━━━━━━━━━━━━━━━━━
🥀 NO ONE IS SPECIAL!
━━━━━━━━━━━━━━━━━━━━━━━
✨ 𝗠𝗔𝗗𝗘 𝗪𝗜𝗧𝗛 𝗠𝗥 𝗕𝗟𝗔𝗖𝗞 𝗞𝗜𝗟𝗟𝗘𝗥 ✓*`;

      await zk.sendMessage(dest, { image: { url: img }, caption: gitdata });
    } else {
      console.log("Could not fetch data");
    }
  } catch (error) {
    console.log("Error fetching data:", error);
  }
});
